Tekla Open API Reference for Tekla Structures 2025
ElementBase Class
 The ElementBase class is the abstract base class for all mark elements.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.ElementBase
 More...
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class ElementBase : ICloneable,
	IIsEqual
<SerializableAttribute>
Public MustInherit Class ElementBase
	Implements ICloneable, IIsEqual
The ElementBase type exposes the following members.
Methods
Name | Description
Clone
 Creates a new object that is a copy of the current instance.
GetUnformattedString
 Returns the content as a string without formatting.
IsEqual
 Compares the current object with the given object. Checks every field of both objects for equality.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.ElementBase
 Tekla.Structures.Drawing.ContainerElement
 Tekla.Structures.Drawing.NewLineElement
 Tekla.Structures.Drawing.PropertyElement
 Tekla.Structures.Drawing.ReinforcementPulloutElement
 Tekla.Structures.Drawing.ReportTemplateElement
 Tekla.Structures.Drawing.SpaceElement
 Tekla.Structures.Drawing.SymbolElement
 Tekla.Structures.Drawing.TextElement
 Tekla.Structures.Drawing.UserDefinedElement